import random

프레임당쓰러진핀 = [[0, 0] for _ in range(10)]
추가점수 = [[0, 0] for _ in range(10)]
다음투구결과를더하는횟수 = [0,0,0,0,0,0,0,0,0,0] 
프레임당점수 = [0,0]
누적점수 = [0,0,0,0,0,0,0,0,0,0]

for 프레임 in range(10):

    pins = random.randint(0, 10)

  
    for i in range(10):
        if 다음투구결과를더하는횟수[i] > 0:

            if 추가점수[i][0] == 0:
                추가점수[i][0] = pins
            else:
                추가점수[i][1] = pins

            다음투구결과를더하는횟수[i] -= 1

            if 다음투구결과를더하는횟수[i] == 0:
                프레임당점수[i] = (
                  프레임당쓰러진핀[i][0]+프레임당쓰러진핀[i][1]+추가점수[i][0]+ 추가점수[i][1])
                
    print(프레임당점수)
