if pins == 10:
    다음투구결과를더하는횟수[프레임] = 2

else:
    pins2 = random.randint(0, 10 - pins)

    # 과거 업데이트 (두번째 값도 반영해야 함)
    for i in range(10):
        if 다음투구결과를더하는횟수[i] > 0:

            if 추가점수[i][0] == 0:
                추가점수[i][0] = pins2
            else:
                추가점수[i][1] = pins2

            다음투구결과를더하는횟수[i] -= 1

            if 다음투구결과를더하는횟수[i] == 0:
                프레임당점수[i] = (
                    프레임당쓰러진핀[i][0] +
                    프레임당쓰러진핀[i][1] +
                    추가점수[i][0] +
                    추가점수[i][1]
                )

    프레임당쓰러진핀[프레임][1] = pins2

    if pins + pins2 == 10:
        다음투구결과를더하는횟수[프레임] = 1
    else:
        프레임당점수[프레임] = pins + pins2